In [20]:

import pandas as pd
print(pd.__version__)

2.1.1

In [21]:
l=[10,20,30]
l

[10, 20, 30]

In [ ]:
pd.shape

In [25]:
l = [10, 20, 30, 40]
s = pd.Series(l,index=['a','b','c','d'])
print(s)

a    10
b    20
c    30
d    40
dtype: int64

In [26]:
type(s)

pandas.core.series.Series

In [27]:
s.shape

(4,)

In [28]:
# create using 1D array
import numpy as np

In [29]:
a=np.array([10,20,30,40])

In [30]:
a

array([10, 20, 30, 40])

In [31]:
pad=pd.Series(a)

In [32]:
pad

0    10
1    20
2    30
3    40
dtype: int32

In [33]:
d={'name': 'Reya', 'age': 20, 'course': 'Python', 'marks': 85}
d

{'name': 'Reya', 'age': 20, 'course': 'Python', 'marks': 85}

In [34]:
s=pd.Series(d)

In [35]:
s

name        Reya
age           20
course    Python
marks         85
dtype: object

In [36]:
d={'name': 'Reya Devraj', 'age': 21, 'city': 'Bhubaneswar', 'hobby': 'Coding'}
d

{'name': 'Reya Devraj', 'age': 21, 'city': 'Bhubaneswar', 'hobby': 'Coding'}

In [37]:

s=pd.Series(d)
s

name     Reya Devraj
age               21
city     Bhubaneswar
hobby         Coding
dtype: object

In [41]:
d={'col1':[1,2,3],'col2':[10,20,'dev']}
df=pd.DataFrame(d)
df

   col1 col2
0     1   10
1     2   20
2     3  dev

In [42]:
type(df)

pandas.core.frame.DataFrame

In [43]:
df.shape

(3, 2)

df.ndim

In [44]:
df.ndim

2

In [45]:
# creating a 2D array (list of lists)
arr_2d=np.array([[1,2,3],[4,5,6]])
arr_2d

array([[1, 2, 3],
       [4, 5, 6]])

In [49]:
df2=pd.DataFrame(arr_2d,index=['a','b'],columns=['s','r','k'])

In [50]:
df2

   s  r  k
a  1  2  3
b  4  5  6

In [51]:
data = {
    "name": ["Reya", "Amit", "Sita"],
    "age": [21, 22, 23],
    "city": ["Bhubaneswar", "Cuttack", "Puri"]
}

# create dataframe
df = pd.DataFrame(data)

In [52]:
df

   name  age         city
0  Reya   21  Bhubaneswar
1  Amit   22      Cuttack
2  Sita   23         Puri

In [56]:
df1=df.set_index("age")
df1

     name         city
age
21   Reya  Bhubaneswar
22   Amit      Cuttack
23   Sita         Puri

In [72]:
df1=df1.reset_index("age")

KeyError: 'Requested level (age) does not match index name (None)'

In [73]:
df1

Empty DataFrame
Columns: [age, name, city]
Index: []

In [74]:
df1

Empty DataFrame
Columns: [age, name, city]
Index: []

In [75]:
data = {
    "name": ["Reya", "Amit", "Sita"],
    "age": [21, 22, 23],
    "city": ["Bhubaneswar", "Cuttack", "Puri"]
}

# create dataframe
df = pd.DataFrame(data)

In [76]:
df

   name  age         city
0  Reya   21  Bhubaneswar
1  Amit   22      Cuttack
2  Sita   23         Puri

In [77]:
df=df.drop(index=[0,2])

In [78]:
df

   name  age     city
1  Amit   22  Cuttack

In [79]:
df.drop(columns="city")

   name  age
1  Amit   22

In [80]:
df

   name  age     city
1  Amit   22  Cuttack

In [81]:
import pandas as pd

# dictionary with 10 rows of data
data = {
    "name": ["Reya", "Amit", "Sita", "Rohan", "Priya", 
             "Kunal", "Anita", "Vikram", "Meera", "Arjun"],
    "age": [21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
    "city": ["Bhubaneswar", "Cuttack", "Puri", "Delhi", "Mumbai", 
             "Kolkata", "Chennai", "Hyderabad", "Pune", "Jaipur"]
}

# create dataframe
df = pd.DataFrame(data)

print(df)

     name  age         city
0    Reya   21  Bhubaneswar
1    Amit   22      Cuttack
2    Sita   23         Puri
3   Rohan   24        Delhi
4   Priya   25       Mumbai
5   Kunal   26      Kolkata
6   Anita   27      Chennai
7  Vikram   28    Hyderabad
8   Meera   29         Pune
9   Arjun   30       Jaipur

In [86]:
df=df.sort_values(by='age',ascending=True)

In [85]:
df

     name  age         city
9   Arjun   30       Jaipur
8   Meera   29         Pune
7  Vikram   28    Hyderabad
6   Anita   27      Chennai
5   Kunal   26      Kolkata
4   Priya   25       Mumbai
3   Rohan   24        Delhi
2    Sita   23         Puri
1    Amit   22      Cuttack
0    Reya   21  Bhubaneswar

In [87]:
import pandas as pd

# dictionary with 10 different rows of data
data2 = {
    "name": ["Neha", "Ravi", "Komal", "Sanjay", "Tina", 
             "Deepak", "Lakshmi", "Manish", "Kiran", "Swati"],
    "age": [19, 20, 21, 22, 23, 24, 25, 26, 27, 28],
    "city": ["Lucknow", "Patna", "Indore", "Nagpur", "Surat", 
             "Kanpur", "Bhopal", "Vadodara", "Rajkot", "Agra"]
}

# create dataframe
df2 = pd.DataFrame(data2)

print(df2)

      name  age      city
0     Neha   19   Lucknow
1     Ravi   20     Patna
2    Komal   21    Indore
3   Sanjay   22    Nagpur
4     Tina   23     Surat
5   Deepak   24    Kanpur
6  Lakshmi   25    Bhopal
7   Manish   26  Vadodara
8    Kiran   27    Rajkot
9    Swati   28      Agra

In [88]:
df2['sex']=['male','female','male','female','male','female','male','female','male','female']

In [89]:
df2

      name  age      city     sex
0     Neha   19   Lucknow    male
1     Ravi   20     Patna  female
2    Komal   21    Indore    male
3   Sanjay   22    Nagpur  female
4     Tina   23     Surat    male
5   Deepak   24    Kanpur  female
6  Lakshmi   25    Bhopal    male
7   Manish   26  Vadodara  female
8    Kiran   27    Rajkot    male
9    Swati   28      Agra  female

In [92]:
df

     name  age         city
0    Reya   21  Bhubaneswar
1    Amit   22      Cuttack
2    Sita   23         Puri
3   Rohan   24        Delhi
4   Priya   25       Mumbai
5   Kunal   26      Kolkata
6   Anita   27      Chennai
7  Vikram   28    Hyderabad
8   Meera   29         Pune
9   Arjun   30       Jaipur

In [93]:
df2

      name  age      city     sex
0     Neha   19   Lucknow    male
1     Ravi   20     Patna  female
2    Komal   21    Indore    male
3   Sanjay   22    Nagpur  female
4     Tina   23     Surat    male
5   Deepak   24    Kanpur  female
6  Lakshmi   25    Bhopal    male
7   Manish   26  Vadodara  female
8    Kiran   27    Rajkot    male
9    Swati   28      Agra  female

In [94]:
pd.concat([df,df1],axis=1)

     name  age         city  age name city
0    Reya   21  Bhubaneswar  NaN  NaN  NaN
1    Amit   22      Cuttack  NaN  NaN  NaN
2    Sita   23         Puri  NaN  NaN  NaN
3   Rohan   24        Delhi  NaN  NaN  NaN
4   Priya   25       Mumbai  NaN  NaN  NaN
5   Kunal   26      Kolkata  NaN  NaN  NaN
6   Anita   27      Chennai  NaN  NaN  NaN
7  Vikram   28    Hyderabad  NaN  NaN  NaN
8   Meera   29         Pune  NaN  NaN  NaN
9   Arjun   30       Jaipur  NaN  NaN  NaN

In [96]:
df3=pd.concat([df,df1])
df3

     name  age         city
0    Reya   21  Bhubaneswar
1    Amit   22      Cuttack
2    Sita   23         Puri
3   Rohan   24        Delhi
4   Priya   25       Mumbai
5   Kunal   26      Kolkata
6   Anita   27      Chennai
7  Vikram   28    Hyderabad
8   Meera   29         Pune
9   Arjun   30       Jaipur